{
  "bookId": "68b47b13645cc5f09ec0d566",
  "chunks": [
    "S \nAravind Veggalam \nOracle APEX D e v e l o p e r \nResults-driven Oracle APEX Developer with 3.6 years of extensive experience in the design, deployment, and maintenance of dynamic web \napplications utilizing Oracle Application Express (APEX). Adept in PL/SQL, SQL, HTML, CSS, and JavaScript consistently delivering high-quality \nsolutions within stringent timelines. Recognized for exceptional problem-solving skills, a commitment to continuous learning, and professional \ndevelopment. A collaborative and innovative team player dedicated to achieving project objectives with precision and excellence. \nExperience \nWinfo Solutions Private Limited, Hyderabad (2021 - Present) \n \nWinfoTest(Product) - Oracle APEX Implementation & Support: \n Designed and developed APEX reports, including interactive grids and master-detail forms. \n Created and optimized database queries to enhance application performance. \n Built customized reports in both web and paper layouts to meet client specifications.",
    "Created and optimized database queries to enhance application performance. \n Built customized reports in both web and paper layouts to meet client specifications. \n Utilized APEX debug techniques and exception handling APIs to troubleshoot and resolve \nissues. \n Delivered technical resolutions and support for APEX-related issues logged by users. \n Designed data models, optimized performance, integrated RESTful web services, and applied \ncustom styling for enhanced UI. \n Enhanced frontend user interfaces using CSS, jQuery, and Bootstrap, ensuring a \nresponsive and interactive design for improved user experience. \n Knowledge of social sign-in implementation for user authentication. \n Designed and developed a robust Chrome extension plugin (WinfoTest Script \nAssistant) using JavaScript and jQuery to automate the recording of user actions on \nwebsites, enabling seamless script generation and integration into the product workflow. \n \n \nWinfo Referral Portal (Internal):",
    "websites, enabling seamless script generation and integration into the product workflow. \n \n \nWinfo Referral Portal (Internal): \n Independently developed and launched a fully functional APEX application within 3 days, \nincluding table structures, procedures, and functions. \n Designed and implemented interactive grids, reports, dynamic actions, dashboards, and \nfeatures like file upload/download, themes, and templates using CSS, JavaScript, and HTML. \n Automated recruitment workflows by scheduling interviews, sending emails, and blocking \nemployee calendars through the application. \n Resolved technical issues, provided day-to-day support as the primary APEX point of \ncontact, and enforced security using Authorization Schemes. \n \nICON – EU CTR (Clinical Trial Regulation) Tracker Application: \n Designed and implemented database structures, including tables, procedures, and functions, \nto support application development.",
    "ICON – EU CTR (Clinical Trial Regulation) Tracker Application: \n Designed and implemented database structures, including tables, procedures, and functions, \nto support application development. \n Developed APEX pages with interactive grids, reports, filters, dynamic actions, and form \nvalidations, utilizing CSS, JavaScript, and HTML for enhanced functionality. \n Prepared technical and test documentation while integrating features like social sign-in for \nseamless user authentication. \n \nFincare Small Finance Bank, Huzurabad (2020 - 2021) \n \n \nCertifications: \n Oracle APEX Cloud Developer Certified Professional (IZ0-770).\n Oracle Cloud Infrastructure 2023 Certified Digital Assistant Professional (1Z0-1071-23)\n Oracle APEX: Empowering Low Code Apps with AI badge, Oracle\n \n Awards & Recognition \n(In organization)  \n Spot Award (Dec 2022) \nLearning Award (March 2022) \nSpot Award (January 2025) \nContact \nPhone \n \nEmail \nAravindveggalam365@gmail.com \nAddress",
    "Awards & Recognition \n(In organization)  \n Spot Award (Dec 2022) \nLearning Award (March 2022) \nSpot Award (January 2025) \nContact \nPhone \n \nEmail \nAravindveggalam365@gmail.com \nAddress \nHyderabad, Telangana - 500084 \nLinkedIn \nhttps://www.linkedin.com/in/aravind- \nveggalam \n \nEducation \nTelangana University, Nizamabad \nCGPA: 7.37 \n \nSkills  \nOracle APEX, Oracle SQL, \nPL/SQL \n \nJavaScript, jQuery HTML, CSS, \nBootstrap, Python \n \nJenkins, Postman, Git, GitHub \nDesktop, Oracle SQL \nDeveloper, OCI \n \nMicrosoft Excel, MS Word, MS \nPowerPoint, Windows 7/8/10 \nHobbies \nChess \nTennis \n\nTeam Collaboration \nLanguage \nEnglish \nHindi"
  ],
  "timestamp": "2025-08-31T16:40:54.840Z"
}